-- phpMyAdmin SQL Dump
-- version 4.6.6deb5
-- https://www.phpmyadmin.net/
--
-- Хост: localhost:3306
-- Время создания: Апр 17 2019 г., 14:11
-- Версия сервера: 5.7.25-0ubuntu0.18.04.2
-- Версия PHP: 7.2.16-1+ubuntu18.04.1+deb.sury.org+1

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `book`
--

-- --------------------------------------------------------

--
-- Структура таблицы `category`
--

CREATE TABLE `category` (
  `id` int(11) NOT NULL,
  `name` varchar(255) CHARACTER SET utf8 NOT NULL,
  `sort_order` int(11) NOT NULL DEFAULT '0',
  `status` int(11) NOT NULL DEFAULT '1'
) ENGINE=InnoDB DEFAULT CHARSET=latin1;

--
-- Дамп данных таблицы `category`
--

INSERT INTO `category` (`id`, `name`, `sort_order`, `status`) VALUES
(1, 'Фантастика', 1, 1),
(2, 'Детская литература', 2, 1),
(3, 'Художественная литература', 3, 1),
(4, 'Учебная литература', 4, 1);

-- --------------------------------------------------------

--
-- Структура таблицы `product`
--

CREATE TABLE `product` (
  `id` int(11) NOT NULL,
  `name` varchar(255) CHARACTER SET utf8 DEFAULT NULL,
  `category_id` int(11) DEFAULT NULL,
  `code` int(11) DEFAULT NULL,
  `price` float DEFAULT NULL,
  `availability` int(11) DEFAULT NULL,
  `description` text CHARACTER SET utf8,
  `author` varchar(255) CHARACTER SET utf8 DEFAULT NULL,
  `publishing_house` varchar(255) CHARACTER SET utf8 DEFAULT NULL,
  `page_number` int(11) DEFAULT NULL,
  `year` int(11) DEFAULT NULL,
  `is_new` int(11) DEFAULT '0',
  `is_recommended` int(11) DEFAULT '0',
  `status` int(11) DEFAULT '1'
) ENGINE=InnoDB DEFAULT CHARSET=latin1;

--
-- Дамп данных таблицы `product`
--

INSERT INTO `product` (`id`, `name`, `category_id`, `code`, `price`, `availability`, `description`, `author`, `publishing_house`, `page_number`, `year`, `is_new`, `is_recommended`, `status`) VALUES
(1, 'Записки українського самашедшего', 3, 10142, 150, 1, 'Роман написано від імені 35-річного комп’ютерного програміста, який на тлі особистої драми прискіпливо, глибоко й болісно сканує усі вивихи нашого глобалізованого часу.\r\n\r\nУ світі надмірної (дез)інформації і тотального відчуження він — заручник світових абсурдів — прагне подолати комунікативну прірву між чоловіком і жінкою, між родиною і професією, між Україною і світом.\r\n\r\nЗа жанровою стилістикою «Записки українського самашедшого» — насичений мікс художньої літератури, внутрішніх щоденників, сучасного літописання і публіцистики.', 'Ліна Костенко', 'А-ба-ба-га-ла-ма-га', 416, 2011, 0, 1, 1),
(2, 'Кобзар', 3, 22942, 800, 1, 'На відміну від численних так званих «повних» збірок, пропоноване видання є насправді максимально повним зібранням поетового спадку, яке поєднало всі твори, що потрапляли під цензурування як за царату, так і за радянщини. До того ж чимало творів подано з авторовими варіянтами, практично невідомими широкому загалові. Основну частину розпочинає авторова передмова до другого (нездійсненого) видання «Кобзаря». Зануритись у Шевченкову добу допоможуть чимало унікальних прижиттєвих документів, поетових автографів віршів, листів, і світлин й автопортретів. Нарешті, усе видання, від першої до останньої сторінки, унормовано згідно з правилами українського правопису 1928 р.(т. зв. Харківського, або Скрипниківського правопису), який, на думку науковців-філологів, є історично й фонетично найближчим до мови, якою промовляв до нас Поет.', 'Тарас Шевченко', 'Школа (Харків)', 576, 2013, 0, 0, 1),
(3, 'Граф Монте-Кристо', 3, 3, 590, 1, 'Как и сто шестьдесят пять лет назад, \"Граф Монте-Кристо\" Александра Дюма остается одним из самых популярных романов в мировой литературе. К нему писали продолжения, его ставили на сцене, создавали мюзиклы, экранизировали, но и по сей день бесчисленные издания этой книги доставляют удовольствие новым и новым поколениям читателей. История молодого парижанина, которого приятели в шутку засадили в тюрьму, почерпнута автором в архивах парижской полиции. А из-под пера мастера выходит моряк Эдмон Дантес, мученик замка Иф. Не дождавшись правосудия, он решает сам вершить суд и жестоко мстит врагам, разрушившим его счастье.', 'Александр Дюма', 'Азбука', 1264, 2017, 0, 0, 1),
(4, 'Волшебные единороги (+ наклейки)', 1, 4, 208, 1, 'Мы приглашаем тебя в волшебный и чарующий мир, где под звездным небом спят грациозные создания - единороги! Они пасутся на солнечном лугу, скачут по радуге и иногда живут в ледяных замках. На страницах этой книги оживает сказка, а с помощью блестящих наклеек история единорогов становится по-настоящему фантастической.\r\n\r\n- Единороги захватили умы людей: сегодня эта тема как никогда популярна и востребована;\r\n\r\n- Книга большого формата;\r\n\r\n- Более 200 наклеек, среди которых есть целый разворот с БЛЕСТЯЩИМИ наклейками;\r\n\r\n- Красочные иллюстрации и оригинальный стиль рисования;\r\n\r\n- Отличный подарок для любителей всего сказочного и волшебного!\r\n', 'Ирина Позина', 'Эксмо', 24, 2018, 0, 1, 1),
(5, 'Волшебная приставка', 1, 5, 215, 1, 'Фред и Элли получили в подарок волшебную приставку, с помощью которой можно превратиться в персонажа любимой игры и соответственно овладеть всеми его навыками. Теперь им никакие школьные хулиганы и задаваки не страшны. Вот только Фред и Элли не знали, что волшебством невозможно управлять, оно слишком быстро выходит из-под контроля. Особенно если ты не единственный обладатель чудес...\r\n\r\n \r\n\r\nФред и Элли - двойняшки. И они все делают вместе. Иногда им даже кажется, будто они слышат мысли друг друга. И в игры они, конечно же, тоже играют вместе. Но вот однажды к ним в руки попадает необычная волшебная приставка, с помощью которой можно превратиться в персонажа любимой игры и поставить на место хулигана, выиграть футбольный мяч или даже проявить невообразимые чудеса ловкости, прыгая по крышам, а то и взбираясь по отвесной стене. Кажется теперь у Фреда и Элли все пойдет как по маслу, и ни один задира им не помеха. Но оказывается, волшебство слишком быстро выходит из-под контроля. Особенно, если ты не единственный обладатель чудес...\r\n', 'Дэвид Бэддил', 'Эксмо', 416, 2017, 0, 0, 1),
(6, 'Коти-вояки. Нове пророцтво. Книга 3. Світанок', 1, 6, 135, 1, 'Серія пригодницьких романів \"Коти-вояки\" (в оригіналі Warriors) - світовий хіт у жанрі фентезі, написаний колективом авторів під псевдонімом Ерін Гантер.\r\n\r\nПублікувати \"Коти-вояки\" українською взялося харківське видавництво АССА. Перша книга була видана у серпні 2016 року. Наразі вітчизняні читачі вже мають можливість ознайомитися з десятьма творами популярного циклу.\r\n\r\nКнига \"Світанок\" - третя частина циклу \"Нове пророцтво\", що є другим по рахунку в серії.\r\n\r\nПісля довготривалої мандрівки обрані коти повернулися додому із зловісною новиною: Клани повинні об’єднатись і вирушити на пошуки нового дому або будуть знищені. Неможливо передбачити, яких небезпек можуть зазнати коти-вояки, за межами їх володінь. Але ще більш важливим є те, що вони і гадки не мають куди йти. Чи зможуть юні коти і борсучиха переконати досвідчених провідників довіритися їхнім словам? Що чекає попереду знесилених і голодних Кланів, в яких залишилося обмаль часу?\r\n\r\nУсім їм потрібен знак від Зореклану. Але чому він мовчить?', 'Ерін Гантер', 'АССА', 352, 2019, 1, 0, 1),
(7, 'Четырнадцатая золотая рыбка', 1, 7, 234, 1, 'Милая, добрая и смешная книга известной американской писательницы Дженнифер Л. Холм, автора бестселлеров The New York Times, а также обладательницы трех медалей Ньюбери. В жизни одиннадцатилетней Элли никогда не происходило ничего удивительного. Но однажды к ней домой заявился четырнадцатилетний мальчишка с длинными волосами. Он был удивительно похож на ее... дедушку! Великий исследователь, дедушка Элли всегда был одержим идеей вечной молодости. Его последнее изобретение — эликсир бессмертия. Опробовав его на себе, дедушка неожиданно стал молодеть и превратился в мальчика. Теперь ему нужно запатентовать свое открытие. Но не все так просто, ведь дедушка подросток и никто не верит в его изобретение. На помощь ученому приходят Элли и ее верные друзья.', 'Дженнифер Л. Холм', 'Рипол Классик', 208, 2017, 0, 0, 1),
(8, 'Дитя песиголовців', 1, 8, 158, 1, 'Марта на прізвисько Відьма знає, чому батько повернувся з-за річки саме таким. Та вона досі не уявляє, що тепер їй робити і як його врятувати. Здається, єдина людина, котра може допомогти, — класний керівник Людвіг Штоц, та він віднедавна дуже сильно змінився. І це не дивно: після того, як в місті з’явилися песиголовці, все пішло шкереберть. Так, неначе минуле прокинулося й проростає у теперішньому житті гострими драконячими зубами…  «Дитя песиголовців» — довгоочікуване продовження «Пороху із драконових кісток», роману, що потрапив до фіналу премій «Рейтинг критиків», «Літакцент» та «Книгуру» та був рекомендований Міністерством освіти України для додаткового читання у шкільній програмі з української літератури.', 'Володимир Арєнєв', 'АССА', 416, 2018, 0, 0, 1),
(9, 'Фелікс, Нет і Ніка та банда «Невидимих»', 1, 34109, 160, 1, '«Фелікс, Нет і Ніка та банда “Невидимих”» — перша книга популярної у всьому світі серії підліткового фентезі польського письменника Рафала Косіка. \r\n\r\nГерої бестселера «Фелікс, Нет і Ніка» — звичайні 13-річні підлітки з незвичайним умінням знаходити собі пригоди.\r\n\r\nЗнайомтесь…\r\n\r\nФелікс — розумник та винахідник, який буквально з нічого може розробити геніальний план і нову модель робота.\r\n\r\nНет — комп’ютерний геній, що примудрився потоваришувати зі штучним інтелектом.\r\n\r\nНіка — дівчина-таємниця, здатна підкорити будь-яку вершину, серце хлопця і… силу тяжіння.\r\n\r\nРазом вони — непереможна команда,  яка повсякчас потрапляє в різні детективні історії і якій під силу протистояти шкільним хуліганам, банді грабіжників і навіть духам.\r\n', 'Рафал Косік', 'АССА', 420, 2019, 1, 1, 1),
(10, 'Речной доктор', 1, 35732, 394, 1, 'В новый сборник Кира Булычева \"Речной доктор\" вошли повести как фантастические, так и сказочные. В первых - фантастических - действующими лицами являются обычные мальчишки и девчонки, которым жизнь подбрасывает невероятные приключения. А вторые - сказочные - знакомят читателя с такими подробностями жизни волшебного мира, о которых в обычных сказках говорить не принято. Например о том, как маленький школьник Бадик, потерявший родителей, превратился в знаменитого Синдбада-Морехода. Или о том, какие родственные отношения связывают Спящую Красавицу и Красную Шапочку, и чем закончится всем известная история о путешествии к Бабушке, если рассказать ее чуточку по-новому.', 'Кир Булычев', 'Издательский Дом Мещерякова', 192, 2016, 0, 0, 1),
(11, 'Чарівна крамниця', 1, 64322, 65, 1, 'Ця книга знайомить читача з одним із найкращих зразків малої прози Герберта Веллса (1866—1946) — відомого­ англійського письменника-фантаста.\r\n\r\n \r\n\r\nПерсонажами його оповідань стають люди, у розмірене життя яких вривається щось незвичайне: чи то наукове відкриття, чи то чарівник, котрий виконує всі бажання­, чи просто голодний страус, що випадково проковтнув діамант. Оповідач за проханням маленького сина заходить у крамницю \"магічних товарів\". Спочатку йому здається, що це просто продаж реквізиту для фокусників. Але чимдалі хазяїн демонструє йому свій крам, тим більше в оповідача враження, що тут панує справжнє чарівництво...\r\n', 'Герберт Веллс', 'BookChef', 96, 2019, 1, 1, 1),
(12, 'Агенція \"Локвуд і Ко\": Сходи, що кричать', 1, 12934, 130, 1, 'Привиди повертаються, щоб помститися живим! Після заходу сонця вулиці міст заполонили злі духи…\r\nВи боїтеся смертельного доторку привида? Коли кількість нападів духів щодня зростає, агенції психологічних розслідувань стають популярними як ніколи. Найменша, найкрихкіша — та водночас і найкраща з них — агенція «Локвуд і К°»!\r\n\r\nПознайомтеся із завзятим і трохи дивакуватим Ентоні Лок­ву­дом, а також із його вірним помічником — книголюбом Джор­джем Кабінсом та їхньою новою колегою, відважною Люсі Карлайл! Разом вони застосовуватимуть свої незвичайні таланти для порятунку вашого — і, звичайно ж, свого — життя!\r\n', 'Джонатан Страуд', 'А-БА-БА-ГА-ЛА-МА-ГА ', 320, 2019, 1, 1, 1),
(13, 'Принцы в башне', 1, 11111, 438, 1, 'У Алисы Селезневой за плечами уже большой опыт путешествий во времени. На этот раз Алиса отправляется в Тауэр - королевский замок в Лондоне. Ей предстоит познакомиться с семьей правителя Англии Эдуарда IV и узнать о коварном замысле его брата - герцога Ричарда Глостера.', 'Кир Булычев', 'Издательский Дом Мещерякова', 256, 2016, 0, 0, 1),
(14, 'Nitty Winnie', 1, 11112, 133, 1, 'In four new stories, illustrated by Korky Paul, everyone\'s favourite witch tries living in a sandcastle, going back to the time of the dinosaurs, planning a wedding, and getting rid of nasty nits - welcome to Winnie\'s world!\r\n\r\nWinnie the Witch does things differently! In \'Winnie\'s Wet Weekend\' Winnie and Wilbur escape to the seaside where Winnie discovers the perils of living in a sandcastle; in \'Jurassic Winnie\' a quest for a cereal packet collector\'s card sends Winnie and Wilbur back to the time of the dinosaurs; in \'A Wedding for Winnie\' the preparations for her sister Wendy\'s wedding take a crazy turn when Winnie is put in charge; and in \'Nitty Winnie\' find out what happens when Winnie\'s head is invaded by some tiny uninvited guests! Four crazily funny stories featuring everyone\'s favourite witch, her big black cat, Wilbur, and a zany supporting cast of new characters. Korky Paul\'s exuberant black line illustrations complement the humour, slapstick, and moments of real drama that run through each story. Pure magic!\r\n', 'Laura Owen ', 'Oxford University Press', 96, 2012, 0, 0, 1),
(15, 'Harry Potter and the Philosopher\'s Stone (Illustrated Edition)', 1, 67345, 502, 1, 'Jim Kay\'s dazzling depiction of J.K. Rowling\'s wizarding world has won legions of fans since the Illustrated Edition of Harry Potter and the Philosopher\'s Stone was published in hardback in 2015, becoming a bestseller around the world. This irresistible smaller-format paperback edition of J.K. Rowling\'s novel brings the magic of Jim Kay\'s illustration to new readers, with full-colour pictures, French flaps and a handsome poster pull-out at the back of the book. This edition has been beautifully redesigned with selected illustration highlights – the fully illustrated edition is still available in hardback.\r\n\r\nWhen a letter arrives for Harry Potter on his eleventh birthday, a decade-old secret is revealed to him that apparently he\'s the last to know. An incredible adventure is about to begin!', 'Джоан Кэтлин Роулинг', 'Bloomsbury', 256, 2018, 0, 0, 1),
(16, 'Меч генерала Бандулы', 1, 24111, 416, 1, '1824 год, Англия успешно завоёвывает Индию и идёт войной на соседнюю страну Бирму. Иван Исаев, русский матрос, несколько лет назад попавший в кораблекрушение, теперь служит артиллеристом у бирманского генерала Бандулы.\r\n\r\nГенерал даёт ему важное поручение - вывезти легендарный меч из страны. Но отважному матросу это не удаётся, и меч на протяжении столетий считается утерянным.\r\n\r\nИ только его потомок, двенадцатилетний мальчик Игорь Исаев, может разгадать тайну исчезнувшего меча во время путешествия с родителями в Бирму.\r\n', 'Кир Булычев', 'Издательский Дом Мещерякова', 240, 2016, 0, 0, 1),
(17, 'Метла и костёр', 1, 78781, 441, 1, 'Книга английской писательницы Мэри Нортон \"Метла и костер\" рассказывает о новых приключениях начинающей колдуньи мисс Прайс и ее юных друзей Кэри, Чарльза и Пола. Они встретились вновь через два года. На этот раз их ждут захватывающие и невероятные путешествия в Средневековье. Вторую часть сказки о мисс Прайс и ее друзьях, так же как и первую, проиллюстрировал мастер книжной иллюстрации и станковой графики Вадим Челак, для которого герои Мэри Нортон стали уже добрыми друзьями.', 'Мэри Нортон', 'Лабиринт', 104, 2014, 0, 0, 1),
(18, 'Книга ', 2, 84242, 130, 1, 'Франк Ейнштейн — юний геній, науковець і винахідник. Дзвяк — самозбірна особа зі штучним інтелектом. Бряк — майже самозбірна особа зі штучним інтелектом. Разом вони створюють електропалець, прилад, який принесе всьому Мідвілу безкоштовну бездротову енергію. Ті - Едісон, однокласник і головний суперник Франка, може, й не має клепки в голові, але разом із паном Шимпаном закрутить гайки і зіпсує Франкові плани!\r\n\r\nДля дітей молодшого і середнього шкільного віку.', 'Джон Щєшка', 'KM Publishing', 176, 2019, 1, 1, 1),
(19, 'Залізний вовк', 2, 45656, 80, 1, 'Граф Горгій побився об заклад, що впіймає на полюванні небаченого досі звіра. Так і стається, проте на бенкеті на честь полювання хтось потай випускає залізного вовка, і той тікає. Підозра падає на десятирічного сина графа — Віра. Ціна зради дуже висока, і лютий батько проганяє хлопчика геть. Хлопчик залишається сам у лісі, тепер він мусить боротися за своє життя. Та поруч із Віром — його вірний щур Дада. Разом вони знаходять шлях до маєтку, де їм дають притулок...\r\n\r\n \r\n\r\nДинамічний сюжет, екшн та переживання за героїв захоплять юних читачів.', 'Оксана Лущевська', 'Видавництво Старого Лева', 136, 2019, 1, 0, 1),
(20, 'Тореадори з Васюківки', 2, 67983, 120, 1, '“Тореадори з Васюківки” — книга, наповнена пригодами, жартами та добротою. Це один із творів Всеволода Зіновійовича Нестайка, що стали його візитівками на світовій літературній арені.\r\nЯскраві події твору начебто зумовлені неймовірним бажанням бешкетника Яви та його трішки спокійнішого приятеля Павлуші стати відомими на увесь світ. Задля досягнення заповітної мети малі відчайдухи то влаштовують кориду із коровою на ім’я Контрибуцiя, то намагаються вистежити серед односельців іноземних шпигунів, то вирішують підкорити українську столицю і таке інше.', 'Всеволод Нестайко', 'А-БА-БА-ГА-ЛА-МА-ГА', 544, 2018, 0, 0, 1),
(21, 'Ау-у! Где ты, Прекрасный Принц?', 2, 53753, 219, 1, 'Ну сколько можно ждать Волшебного Принца, сидя в башне? Терпение лопнуло! Маленькие принцессы, Роза и Жозефина, отправляются на его поиски. Дорога длинная и опасная: темный лес, причудливые домики со странными жителями, загадочные тропы в неизвестность ...\r\n\r\nНу-ка, помоги принцессам преодолеть препятствия и добраться заветной цели!', 'Сильви Мишлен', 'Vivat Publishing', 40, 2019, 1, 1, 1),
(22, 'Джордж і корабель часу', 2, 12465, 150, 1, 'Коли Джордж застрибує в космічний корабель і разом із вірним супутником Бульцманом мчить крізь незнані простори, то навіть уявити не може, чим усе обернеться. Бо приземлившись, вони опиняються... ні, не на іншій планеті, не в іншій галактиці — а в майбутньому! На хлопця чекає напівзруйнована Земля, якої він не може упізнати. Світ, у якому живуть залякані люди, змушені підкорятися режимові пихатого самодура Трелліса Дампа, світ, де заборонили науку, світ, з якого зникли старовинні міс­та й тропічні ліси, а повітря перетворилося на смог... Чи відшукає Джордж свою давню подружку Енні? І головне — чи вдасться йому змінити похмуре майбутнє? Тож не зволікай і поспіши якнайшвидше дізна­тися, чим завершаться неймовірні пригоди двох друзів, які так полюбилися мільйонам читачів з усього світу!', 'Люсі Гокінг', 'Видавництво Старого Лева', 384, 2019, 1, 0, 1),
(23, 'Срібні ковзани', 2, 9745, 55, 1, 'Найвідоміша книга письменниці «Срібні ковзани» - не просто цікава і зворушлива історія про дитячу дружбу і родинні стосунки, а ще й своєрідний художній посібник із географії, історії, культурних звичаїв і традицій маленької країни Голландії, що притулилася на березі моря, яке невідступно намагається її захопити. Ганс і Гретель мешкають у невеличкому селищі неподалік Амстердама і дуже бідують. Хвороба батька, митарство матері й злигодні заступають дітям щасливе дитинство. А втім, будь-які поневіряння зазвичай мають щасливий Фінал.', 'Мері Мейп Додж', 'BookChef', 272, 2017, 0, 0, 1),
(24, 'Тайны легендарных животных', 2, 77845, 47, 1, 'Пожалуй, одна из самых волнующих загадок нашего времени - существование неведомых животных в дебрях лесов, горах, пустынях и океанах нашей планеты. Время от времени путешественники и местные жители в разных уголках Земли встречают снежного человека, в Австрийских Альпах наталкиваются на гигантских червей, в шотландском озере Лох-Несс наблюдают настоящего плезиозавра... \r\n\r\nО подобных созданиях и пойдет речь в этой книге. Кто они - выдумка шарлатанов или реальные существа, населяющие нашу планету, решать читателю. \r\nЗахватывающие истории, рассказанные в книге, увлекут не только детей, но и любознательных взрослых.\r\n', 'Николай Непомнящий', 'Оникс', 320, 2008, 0, 0, 1),
(25, 'Ганс Брінкер, або Срібні ковзани', 2, 74214, 166, 1, 'Повість “Ганс Брінкер, або Срібні ковзани” американської письменниці Мері Мейпс Додж (1831—1905) — це насамперед захоплива подорож до казкової Голландії, що постає країною чудових озер і каналів, вітряків і розкішних тюльпанів, цікавої історії та вікових традицій. У центрі оповіді діти — брат і сестра з бідної сім’ї, які допомагають матері в роботі й не завжди можуть ходити до школи. Але це їх не засмучує — вони мріють вилікувати хворого батька, перемогти у ковзанярських перегонах і здобути головний приз — срібні ковзани. Наполегливість, сила характеру й віра в добро допомагають їм здійснити свої мрії, а в читача створюється враження, що він якимось дивом побував у казці.', 'Мері Мейпс Додж', 'Знання', 335, 2018, 0, 0, 1),
(26, 'Триста поезій', 3, 14330, 130, 1, 'До книги Ліни Костенко — улюбленої української поетеси кінця другого–початку третього тисячоліття — увійшли найвідоміші її вірші з різних періодів творчості — від ранньої поезії до сьогодні, а також уривки з романів та поем. Це найповніше вибране поетеси за часів Незалежності.', 'Ліна Костенко', 'А-ба-ба-га-ла-ма-га', 432, 2012, 0, 1, 1),
(27, 'Помирана', 3, 24612, 80, 1, 'Новий твір Тараса Антиповича - одного з найважливіших сучасних українських письменників - це вдумливий роман-дистопія, який засобами макабричної сатири розкриває драму зашореного розуму. Герої, чиє існування кероване міфами, ворожі до Іншого і безжальні одне до одного, але водночас не позбавлені надії. У закіптюженій порожнечі їхніх днів раз по раз проблискує те, чого вони бояться найбільше: шанс на краще життя. Шанс позбутись ненависті до тих, хто «по інший бік». Шанс вирватися за «колючку» власноруч виплеканого пекла.', 'Тарас Антипович', 'А-ба-ба-га-ла-ма-га', 224, 2016, 0, 0, 1),
(28, 'Інформатика.Основи алгоритмізації і програмування', 4, 34234, 17, 1, 'Інформатика. Основи алгоритмізації і програмування. Зошит Пропонований посібник відповідає вимогам чинної програми курсу інформатики базового навчального рівня і покликаний допомогти учням при вивченні курсу інформатики за темою «Основи алгоритмізації і програмування». Видання містить основні теоретичні відомості про алгоритмізацію і програмування мовою Паскаль, базові алгоритми й програми, навчальні задачі та приклади їх розв’язування. Посібник складається з основної частини (зошит-конспект) та двох додатків (зошит для практичних і самостійних робіт і методичні рекомендації для вчителя). Зошит-конспект містить завдання для опрацювання теоретичного матеріалу, приклади розв’язування задач і складання програм мовою Паскаль, практичні завдання для самостійного опрацювання, питання для самоконтролю. Зошит для практичних і самостійних робіт містить практичні й самостійні роботи у двох варіантах. Методичні рекомендації для вчителя містять вказівки щодо використання навчальних матеріалів у ході викладання кожної теми, а також відповіді до завдань. Призначено для учнів загальноосвітніх навчальних закладів і вчителів.  ', 'Корниенко Николай', 'Ранок', 48, 2019, 0, 0, 1),
(29, 'УСІ уроки. Усі уроки української літ-ри.', 4, 23426, 85, 1, 'Навчальний посібник містить конспекти всіх уроків української літератури профільного рівня (профіль — українська філологія) для ІІ семестру 10 класу які розроблено із урахуванням змін, здійснених Міністерством освіти і науки України. ', 'Косогова О. О., Муковоз Л. Г.', 'Основа', 40, 2018, 0, 0, 1),
(30, 'Українська мова. Енциклопедія', 4, 23523, 80, 1, 'Видання подає основні загальнотеоретичні поняття мовознавства,найважливіші практичні відомості щодо правил української орфографії та пунктуації, а також знайомить із життєвим шляхом і досягненнями мовознавців та інших діячів української культури, що зробили вагомий внесок у розвиток української мови та мовознавства.', ' Галина Губарева', ' Майстер-клас', 400, 2011, 0, 0, 1);

-- --------------------------------------------------------

--
-- Структура таблицы `product_order`
--

CREATE TABLE `product_order` (
  `id` int(11) NOT NULL,
  `user_name` varchar(255) CHARACTER SET utf8 NOT NULL,
  `user_phone` varchar(255) CHARACTER SET utf8 NOT NULL,
  `user_comment` text CHARACTER SET utf8 NOT NULL,
  `user_id` int(11) DEFAULT NULL,
  `date` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP,
  `products` text CHARACTER SET utf8 NOT NULL,
  `status` int(11) NOT NULL DEFAULT '1'
) ENGINE=InnoDB DEFAULT CHARSET=latin1;

--
-- Дамп данных таблицы `product_order`
--

INSERT INTO `product_order` (`id`, `user_name`, `user_phone`, `user_comment`, `user_id`, `date`, `products`, `status`) VALUES
(2, 'Надя', '0123456789', 'Comment', 0, '2019-04-13 16:48:19', '{\"2\":1}', 1);

-- --------------------------------------------------------

--
-- Структура таблицы `user`
--

CREATE TABLE `user` (
  `id` int(11) NOT NULL,
  `name` varchar(255) CHARACTER SET utf8 NOT NULL,
  `email` varchar(255) CHARACTER SET utf8 NOT NULL,
  `password` varchar(255) CHARACTER SET utf8 NOT NULL,
  `role` varchar(255) CHARACTER SET utf8 NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=latin1;

--
-- Дамп данных таблицы `user`
--

INSERT INTO `user` (`id`, `name`, `email`, `password`, `role`) VALUES
(1, 'Nadiia', 'test@gmail.com', '1234567', 'admin');

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `category`
--
ALTER TABLE `category`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `product`
--
ALTER TABLE `product`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `product_order`
--
ALTER TABLE `product_order`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `user`
--
ALTER TABLE `user`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT для сохранённых таблиц
--

--
-- AUTO_INCREMENT для таблицы `category`
--
ALTER TABLE `category`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=5;
--
-- AUTO_INCREMENT для таблицы `product`
--
ALTER TABLE `product`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=31;
--
-- AUTO_INCREMENT для таблицы `product_order`
--
ALTER TABLE `product_order`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;
--
-- AUTO_INCREMENT для таблицы `user`
--
ALTER TABLE `user`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
